import React from "react"

export const initialPostData = (user) => {
    return({
        name: '',
        creator: null,
        category: '',
        categoryName: '',
        files: [],
        description: '',
        rightDescription: null,
        typeDeal: 'price',
        price: '',
        currency: 'грн',
        haggle: false,
        isBusiness: false,
        isNewItem: true,
        delivery: false,
        postServices: [],
        location: user ? user?.result?.location : '',
        contactFace: user ? user.result?.name : '',
        email: user ? user.result?.email : '',
        phone: user ? user.result?.phone : '',
        date: ''
    })
}

export const categories = [
    {value: 'real_estate', name: 'Недвижимость'},
    {value: 'transport', name: 'Транспорт'},
    {value: 'spare_parts', name: 'Запчасти'},
    {value: 'clothes_and_shoes', name: 'Одежда и обувь'},
    {value: 'job', name: 'Работа'},
    {value: 'services', name: 'Услуги'},
    {value: 'electronic_and_accessories', name: 'Электроника и аксессуары'},
    {value: 'home_technic', name: 'Бытовая техника'},
    {value: 'home_and_garden', name: 'Дом и сад'},
    {value: 'food_and_drink', name: 'Еда и напитки'},
    {value: 'sport_and_leisure', name: 'Спорт и досуг'},
    {value: 'animals', name: 'Животные'},
    {value: 'children', name: 'Детский мир'}
]

export const cities = [
    {
        "name": "Алупка",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Алушта",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Армянск",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Бахчисарай",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Белогорск",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Джанкой",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Евпатория",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Керчь",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Красноперекопск",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Саки",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Севастополь",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Симферополь",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Старый Крым",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Судак",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Феодосия",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Щёлкино",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Ялта",
        "region" : "Автономная Республика Крым"
    },
    {
        "name": "Бар",
        "region" : "Винницкая область"
    },
    {
        "name": "Бершадь",
        "region" : "Винницкая область"
    },
    {
        "name": "Винница",
        "region" : "Винницкая область"
    },
    {
        "name": "Гайсин",
        "region" : "Винницкая область"
    },
    {
        "name": "Жмеринка",
        "region" : "Винницкая область"
    },
    {
        "name": "Казатин",
        "region" : "Винницкая область"
    },
    {
        "name": "Калиновка",
        "region" : "Винницкая область"
    },
    {
        "name": "Ладыжин",
        "region" : "Винницкая область"
    },
    {
        "name": "Могилёв-Подольский",
        "region" : "Винницкая область"
    },
    {
        "name": "Немиров",
        "region" : "Винницкая область"
    },
    {
        "name": "Погребище",
        "region" : "Винницкая область"
    },
    {
        "name": "Тульчин",
        "region" : "Винницкая область"
    },
    {
        "name": "Хмельник",
        "region" : "Винницкая область"
    },
    {
        "name": "Шаргород",
        "region" : "Винницкая область"
    },
    {
        "name": "Ямполь",
        "region" : "Винницкая область"
    },
    {
        "name": "Берестечко",
        "region" : "Волынская область"
    },
    {
        "name": "Владимир-Волынский",
        "region" : "Волынская область"
    },
    {
        "name": "Горохов",
        "region" : "Волынская область"
    },
    {
        "name": "Камень-Каширский",
        "region" : "Волынская область"
    },
    {
        "name": "Киверцы",
        "region" : "Волынская область"
    },
    {
        "name": "Ковель",
        "region" : "Волынская область"
    },
    {
        "name": "Луцк",
        "region" : "Волынская область"
    },
    {
        "name": "Любомль",
        "region" : "Волынская область"
    },
    {
        "name": "Нововолынск",
        "region" : "Волынская область"
    },
    {
        "name": "Рожище",
        "region" : "Волынская область"
    },
    {
        "name": "Устилуг",
        "region" : "Волынская область"
    },
    {
        "name": "Апостолово",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Верхнеднепровск",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Вольногорск",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Днепродзержинск",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Днепропетровск",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Жёлтые Воды",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Кривой Рог",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Марганец",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Никополь",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Новомосковск",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Орджоникидзе",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Павлоград",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Перещепино",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Першотравенск",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Подгородное",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Пятихатки",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Синельниково",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Терновка",
        "region" : "Днепропетровская область"
    },
    {
        "name": "Авдеевка",
        "region" : "Донецкая область"
    },
    {
        "name": "Артёмовск",
        "region" : "Донецкая область"
    },
    {
        "name": "Волноваха",
        "region" : "Донецкая область"
    },
    {
        "name": "Горловка",
        "region" : "Донецкая область"
    },
    {
        "name": "Дзержинск",
        "region" : "Донецкая область"
    },
    {
        "name": "Дебальцево",
        "region" : "Донецкая область"
    },
    {
        "name": "Димитров",
        "region" : "Донецкая область"
    },
    {
        "name": "Доброполье",
        "region" : "Донецкая область"
    },
    {
        "name": "Докучаевск",
        "region" : "Донецкая область"
    },
    {
        "name": "Донецк",
        "region" : "Донецкая область"
    },
    {
        "name": "Дружковка",
        "region" : "Донецкая область"
    },
    {
        "name": "Енакиево",
        "region" : "Донецкая область"
    },
    {
        "name": "Ждановка",
        "region" : "Донецкая область"
    },
    {
        "name": "Зугрэс",
        "region" : "Донецкая область"
    },
    {
        "name": "Кировское",
        "region" : "Донецкая область"
    },
    {
        "name": "Краматорск",
        "region" : "Донецкая область"
    },
    {
        "name": "Красноармейск",
        "region" : "Донецкая область"
    },
    {
        "name": "Красный Лиман",
        "region" : "Донецкая область"
    },
    {
        "name": "Константиновка",
        "region" : "Донецкая область"
    },
    {
        "name": "Мариуполь",
        "region" : "Донецкая область"
    },
    {
        "name": "Макеевка",
        "region" : "Донецкая область"
    },
    {
        "name": "Новогродовка",
        "region" : "Донецкая область"
    },
    {
        "name": "Селидово",
        "region" : "Донецкая область"
    },
    {
        "name": "Славянск",
        "region" : "Донецкая область"
    },
    {
        "name": "Снежное",
        "region" : "Донецкая область"
    },
    {
        "name": "Соледар",
        "region" : "Донецкая область"
    },
    {
        "name": "Торез",
        "region" : "Донецкая область"
    },
    {
        "name": "Угледар",
        "region" : "Донецкая область"
    },
    {
        "name": "Харцызск",
        "region" : "Донецкая область"
    },
    {
        "name": "Шахтёрск",
        "region" : "Донецкая область"
    },
    {
        "name": "Ясиноватая",
        "region" : "Донецкая область"
    },
    {
        "name": "Андрушёвка",
        "region" : "Житомирская область"
    },
    {
        "name": "Барановка",
        "region" : "Житомирская область"
    },
    {
        "name": "Бердичев",
        "region" : "Житомирская область"
    },
    {
        "name": "Житомир",
        "region" : "Житомирская область"
    },
    {
        "name": "Коростень",
        "region" : "Житомирская область"
    },
    {
        "name": "Коростышев",
        "region" : "Житомирская область"
    },
    {
        "name": "Малин",
        "region" : "Житомирская область"
    },
    {
        "name": "Новоград-Волынский",
        "region" : "Житомирская область"
    },
    {
        "name": "Овруч",
        "region" : "Житомирская область"
    },
    {
        "name": "Радомышль",
        "region" : "Житомирская область"
    },
    {
        "name": "Берегово",
        "region" : "Закарпатская область"
    },
    {
        "name": "Виноградов",
        "region" : "Закарпатская область"
    },
    {
        "name": "Иршава",
        "region" : "Закарпатская область"
    },
    {
        "name": "Мукачево",
        "region" : "Закарпатская область"
    },
    {
        "name": "Перечин",
        "region" : "Закарпатская область"
    },
    {
        "name": "Рахов",
        "region" : "Закарпатская область"
    },
    {
        "name": "Свалява",
        "region" : "Закарпатская область"
    },
    {
        "name": "Тячев",
        "region" : "Закарпатская область"
    },
    {
        "name": "Ужгород",
        "region" : "Закарпатская область"
    },
    {
        "name": "Хуст",
        "region" : "Закарпатская область"
    },
    {
        "name": "Чоп",
        "region" : "Закарпатская область"
    },
    {
        "name": "Бердянск",
        "region" : "Запорожская область"
    },
    {
        "name": "Васильевка",
        "region" : "Запорожская область"
    },
    {
        "name": "Вольнянск",
        "region" : "Запорожская область"
    },
    {
        "name": "Гуляйполе",
        "region" : "Запорожская область"
    },
    {
        "name": "Днепрорудное",
        "region" : "Запорожская область"
    },
    {
        "name": "Запорожье",
        "region" : "Запорожская область"
    },
    {
        "name": "Каменка-Днепровская",
        "region" : "Запорожская область"
    },
    {
        "name": "Мелитополь",
        "region" : "Запорожская область"
    },
    {
        "name": "Молочанск",
        "region" : "Запорожская область"
    },
    {
        "name": "Орехов",
        "region" : "Запорожская область"
    },
    {
        "name": "Пологи",
        "region" : "Запорожская область"
    },
    {
        "name": "Приморск",
        "region" : "Запорожская область"
    },
    {
        "name": "Токмак",
        "region" : "Запорожская область"
    },
    {
        "name": "Энергодар",
        "region" : "Запорожская область"
    },
    {
        "name": "Болехов",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Бурштын",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Галич",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Городенка",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Долина",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Ивано-Франковск",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Калуш",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Коломыя",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Косов",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Надворная",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Рогатин",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Снятын",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Тысменица",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Тлумач",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Яремче",
        "region" : "Ивано-Франковская область"
    },
    {
        "name": "Белая Церковь",
        "region" : "Киевская область"
    },
    {
        "name": "Березань",
        "region" : "Киевская область"
    },
    {
        "name": "Богуслав",
        "region" : "Киевская область"
    },
    {
        "name": "Борисполь",
        "region" : "Киевская область"
    },
    {
        "name": "Боярка",
        "region" : "Киевская область"
    },
    {
        "name": "Бровары",
        "region" : "Киевская область"
    },
    {
        "name": "Буча",
        "region" : "Киевская область"
    },
    {
        "name": "Васильков",
        "region" : "Киевская область"
    },
    {
        "name": "Вишнёвое",
        "region" : "Киевская область"
    },
    {
        "name": "Вышгород",
        "region" : "Киевская область"
    },
    {
        "name": "Ирпень",
        "region" : "Киевская область"
    },
    {
        "name": "Кагарлык",
        "region" : "Киевская область"
    },
    {
        "name": "Киев",
        "region" : "Киевская область"
    },
    {
        "name": "Мироновка",
        "region" : "Киевская область"
    },
    {
        "name": "Обухов",
        "region" : "Киевская область"
    },
    {
        "name": "Переяслав-Хмельницкий",
        "region" : "Киевская область"
    },
    {
        "name": "Припять",
        "region" : "Киевская область"
    },
    {
        "name": "Ржищев",
        "region" : "Киевская область"
    },
    {
        "name": "Сквира",
        "region" : "Киевская область"
    },
    {
        "name": "Славутич",
        "region" : "Киевская область"
    },
    {
        "name": "Тараща",
        "region" : "Киевская область"
    },
    {
        "name": "Тетиев",
        "region" : "Киевская область"
    },
    {
        "name": "Узин",
        "region" : "Киевская область"
    },
    {
        "name": "Украинка",
        "region" : "Киевская область"
    },
    {
        "name": "Фастов",
        "region" : "Киевская область"
    },
    {
        "name": "Чернобыль",
        "region" : "Киевская область"
    },
    {
        "name": "Яготин",
        "region" : "Киевская область"
    },
    {
        "name": "Александрия",
        "region" : "Кировоградская область"
    },
    {
        "name": "Бобринец",
        "region" : "Кировоградская область"
    },
    {
        "name": "Гайворон",
        "region" : "Кировоградская область"
    },
    {
        "name": "Долинская",
        "region" : "Кировоградская область"
    },
    {
        "name": "Знаменка",
        "region" : "Кировоградская область"
    },
    {
        "name": "Кировоград",
        "region" : "Кировоградская область"
    },
    {
        "name": "Малая Виска",
        "region" : "Кировоградская область"
    },
    {
        "name": "Новомиргород",
        "region" : "Кировоградская область"
    },
    {
        "name": "Новоукраинка",
        "region" : "Кировоградская область"
    },
    {
        "name": "Светловодск",
        "region" : "Кировоградская область"
    },
    {
        "name": "Александровск",
        "region" : "Луганская область"
    },
    {
        "name": "Алмазная",
        "region" : "Луганская область"
    },
    {
        "name": "Алчевск",
        "region" : "Луганская область"
    },
    {
        "name": "Антрацит",
        "region" : "Луганская область"
    },
    {
        "name": "Брянка",
        "region" : "Луганская область"
    },
    {
        "name": "Вахрушево",
        "region" : "Луганская область"
    },
    {
        "name": "Горное",
        "region" : "Луганская область"
    },
    {
        "name": "Зимогорье",
        "region" : "Луганская область"
    },
    {
        "name": "Золотое",
        "region" : "Луганская область"
    },
    {
        "name": "Зоринск",
        "region" : "Луганская область"
    },
    {
        "name": "Краснодон",
        "region" : "Луганская область"
    },
    {
        "name": "Красный Луч",
        "region" : "Луганская область"
    },
    {
        "name": "Лисичанск",
        "region" : "Луганская область"
    },
    {
        "name": "Луганск",
        "region" : "Луганская область"
    },
    {
        "name": "Лутугино",
        "region" : "Луганская область"
    },
    {
        "name": "Миусинск",
        "region" : "Луганская область"
    },
    {
        "name": "Молодогвардейск",
        "region" : "Луганская область"
    },
    {
        "name": "Новодружеск",
        "region" : "Луганская область"
    },
    {
        "name": "Новопсков",
        "region" : "Луганская область"
    },
    {
        "name": "Первомайск",
        "region" : "Луганская область"
    },
    {
        "name": "Перевальск",
        "region" : "Луганская область"
    },
    {
        "name": "Петровское",
        "region" : "Луганская область"
    },
    {
        "name": "Попасная",
        "region" : "Луганская область"
    },
    {
        "name": "Приволье",
        "region" : "Луганская область"
    },
    {
        "name": "Ровеньки",
        "region" : "Луганская область"
    },
    {
        "name": "Рубежное",
        "region" : "Луганская область"
    },
    {
        "name": "Сватово",
        "region" : "Луганская область"
    },
    {
        "name": "Свердловск",
        "region" : "Луганская область"
    },
    {
        "name": "Северодонецк",
        "region" : "Луганская область"
    },
    {
        "name": "Старобельск",
        "region" : "Луганская область"
    },
    {
        "name": "Стаханов",
        "region" : "Луганская область"
    },
    {
        "name": "Суходольск",
        "region" : "Луганская область"
    },
    {
        "name": "Счастье",
        "region" : "Луганская область"
    },
    {
        "name": "Теплогорск",
        "region" : "Луганская область"
    },
    {
        "name": "Червонопартизанск",
        "region" : "Луганская область"
    },
    {
        "name": "Белз",
        "region" : "Львовская область"
    },
    {
        "name": "Бобрка",
        "region" : "Львовская область"
    },
    {
        "name": "Борислав",
        "region" : "Львовская область"
    },
    {
        "name": "Броды",
        "region" : "Львовская область"
    },
    {
        "name": "Буск",
        "region" : "Львовская область"
    },
    {
        "name": "Великие Мосты",
        "region" : "Львовская область"
    },
    {
        "name": "Глиняны",
        "region" : "Львовская область"
    },
    {
        "name": "Городок",
        "region" : "Львовская область"
    },
    {
        "name": "Добромиль",
        "region" : "Львовская область"
    },
    {
        "name": "Дрогобыч",
        "region" : "Львовская область"
    },
    {
        "name": "Дубляны",
        "region" : "Львовская область"
    },
    {
        "name": "Жидачов",
        "region" : "Львовская область"
    },
    {
        "name": "Жолква",
        "region" : "Львовская область"
    },
    {
        "name": "Золочев",
        "region" : "Львовская область"
    },
    {
        "name": "Каменка-Бугская",
        "region" : "Львовская область"
    },
    {
        "name": "Львов",
        "region" : "Львовская область"
    },
    {
        "name": "Мостиска",
        "region" : "Львовская область"
    },
    {
        "name": "Перемышляны",
        "region" : "Львовская область"
    },
    {
        "name": "Пустомыты",
        "region" : "Львовская область"
    },
    {
        "name": "Рава-Русская",
        "region" : "Львовская область"
    },
    {
        "name": "Радехов",
        "region" : "Львовская область"
    },
    {
        "name": "Рудки",
        "region" : "Львовская область"
    },
    {
        "name": "Самбор",
        "region" : "Львовская область"
    },
    {
        "name": "Сколе",
        "region" : "Львовская область"
    },
    {
        "name": "Сокаль",
        "region" : "Львовская область"
    },
    {
        "name": "Старый Самбор",
        "region" : "Львовская область"
    },
    {
        "name": "Стрый",
        "region" : "Львовская область"
    },
    {
        "name": "Трускавец",
        "region" : "Львовская область"
    },
    {
        "name": "Угнев",
        "region" : "Львовская область"
    },
    {
        "name": "Хыров",
        "region" : "Львовская область"
    },
    {
        "name": "Червоноград",
        "region" : "Львовская область"
    },
    {
        "name": "Яворов",
        "region" : "Львовская область"
    },
    {
        "name": "Баштанка",
        "region" : "Николаевская область"
    },
    {
        "name": "Вознесенск",
        "region" : "Николаевская область"
    },
    {
        "name": "Николаев",
        "region" : "Николаевская область"
    },
    {
        "name": "Новая Одесса",
        "region" : "Николаевская область"
    },
    {
        "name": "Новый Буг",
        "region" : "Николаевская область"
    },
    {
        "name": "Очаков",
        "region" : "Николаевская область"
    },
    {
        "name": "Первомайск",
        "region" : "Николаевская область"
    },
    {
        "name": "Снигирёвка",
        "region" : "Николаевская область"
    },
    {
        "name": "Южноукраинск",
        "region" : "Николаевская область"
    },
    {
        "name": "Ананьев",
        "region" : "Одесская область"
    },
    {
        "name": "Арциз",
        "region" : "Одесская область"
    },
    {
        "name": "Балта",
        "region" : "Одесская область"
    },
    {
        "name": "Белгород-Днестровский",
        "region" : "Одесская область"
    },
    {
        "name": "Болград",
        "region" : "Одесская область"
    },
    {
        "name": "Измаил",
        "region" : "Одесская область"
    },
    {
        "name": "Ильичёвск",
        "region" : "Одесская область"
    },
    {
        "name": "Килия",
        "region" : "Одесская область"
    },
    {
        "name": "Кодыма",
        "region" : "Одесская область"
    },
    {
        "name": "Котовск",
        "region" : "Одесская область"
    },
    {
        "name": "Одесса",
        "region" : "Одесская область"
    },
    {
        "name": "Татарбунары",
        "region" : "Одесская область"
    },
    {
        "name": "Теплодар",
        "region" : "Одесская область"
    },
    {
        "name": "Южное",
        "region" : "Одесская область"
    },
    {
        "name": "Гадяч",
        "region" : "Полтавская область"
    },
    {
        "name": "Глобино",
        "region" : "Полтавская область"
    },
    {
        "name": "Гребёнка",
        "region" : "Полтавская область"
    },
    {
        "name": "Зеньков",
        "region" : "Полтавская область"
    },
    {
        "name": "Карловка",
        "region" : "Полтавская область"
    },
    {
        "name": "Кременчуг",
        "region" : "Полтавская область"
    },
    {
        "name": "Кобеляки",
        "region" : "Полтавская область"
    },
    {
        "name": "Комсомольск",
        "region" : "Полтавская область"
    },
    {
        "name": "Лохвица",
        "region" : "Полтавская область"
    },
    {
        "name": "Лубны",
        "region" : "Полтавская область"
    },
    {
        "name": "Миргород",
        "region" : "Полтавская область"
    },
    {
        "name": "Пирятин",
        "region" : "Полтавская область"
    },
    {
        "name": "Полтава",
        "region" : "Полтавская область"
    },
    {
        "name": "Хорол",
        "region" : "Полтавская область"
    },
    {
        "name": "Червонозаводское",
        "region" : "Полтавская область"
    },
    {
        "name": "Березне",
        "region" : "Ровенская область"
    },
    {
        "name": "Дубно",
        "region" : "Ровенская область"
    },
    {
        "name": "Дубровица",
        "region" : "Ровенская область"
    },
    {
        "name": "Здолбунов",
        "region" : "Ровенская область"
    },
    {
        "name": "Корец",
        "region" : "Ровенская область"
    },
    {
        "name": "Костополь",
        "region" : "Ровенская область"
    },
    {
        "name": "Кузнецовск",
        "region" : "Ровенская область"
    },
    {
        "name": "Острог",
        "region" : "Ровенская область"
    },
    {
        "name": "Радивилов",
        "region" : "Ровенская область"
    },
    {
        "name": "Ровно",
        "region" : "Ровенская область"
    },
    {
        "name": "Сарны",
        "region" : "Ровенская область"
    },
    {
        "name": "Ахтырка",
        "region" : "Сумская область"
    },
    {
        "name": "Белополье",
        "region" : "Сумская область"
    },
    {
        "name": "Бурынь",
        "region" : "Сумская область"
    },
    {
        "name": "Глухов",
        "region" : "Сумская область"
    },
    {
        "name": "Кролевец",
        "region" : "Сумская область"
    },
    {
        "name": "Конотоп",
        "region" : "Сумская область"
    },
    {
        "name": "Лебедин",
        "region" : "Сумская область"
    },
    {
        "name": "Путивль",
        "region" : "Сумская область"
    },
    {
        "name": "Ромны",
        "region" : "Сумская область"
    },
    {
        "name": "Середина-Буда",
        "region" : "Сумская область"
    },
    {
        "name": "Сумы",
        "region" : "Сумская область"
    },
    {
        "name": "Тростянец",
        "region" : "Сумская область"
    },
    {
        "name": "Шостка",
        "region" : "Сумская область"
    },
    {
        "name": "Бережаны",
        "region" : "Тернопольская область"
    },
    {
        "name": "Борщёв",
        "region" : "Тернопольская область"
    },
    {
        "name": "Бучач",
        "region" : "Тернопольскаякая область"
    },
    {
        "name": "Залещики",
        "region" : "Тернопольская область"
    },
    {
        "name": "Збараж",
        "region" : "Тернопольская область"
    },
    {
        "name": "Зборов",
        "region" : "Тернопольская область"
    },
    {
        "name": "Кременец",
        "region" : "Тернопольская область"
    },
    {
        "name": "Лановцы",
        "region" : "Тернопольская область"
    },
    {
        "name": "Монастыриска",
        "region" : "Тернопольская область"
    },
    {
        "name": "Подволочиск",
        "region" : "Тернопольская область"
    },
    {
        "name": "Подгайцы",
        "region" : "Тернопольская область"
    },
    {
        "name": "Почаев",
        "region" : "Тернопольская область"
    },
    {
        "name": "Скалат",
        "region" : "Тернопольская область"
    },
    {
        "name": "Тернополь",
        "region" : "Тернопольская область"
    },
    {
        "name": "Теребовля",
        "region" : "Тернопольская область"
    },
    {
        "name": "Чортков",
        "region" : "Тернопольская область"
    },
    {
        "name": "Шумск",
        "region" : "Тернопольская область"
    },
    {
        "name": "Балаклея",
        "region" : "Харьковская область"
    },
    {
        "name": "Барвенково",
        "region" : "Харьковская область"
    },
    {
        "name": "Богодухов",
        "region" : "Харьковская область"
    },
    {
        "name": "Валки",
        "region" : "Харьковская область"
    },
    {
        "name": "Великий Бурлук",
        "region" : "Харьковская область"
    },
    {
        "name": "Волчанск",
        "region" : "Харьковская область"
    },
    {
        "name": "Дергачи",
        "region" : "Харьковская область"
    },
    {
        "name": "Змиев",
        "region" : "Харьковская область"
    },
    {
        "name": "Изюм",
        "region" : "Харьковская область"
    },
    {
        "name": "Красноград",
        "region" : "Харьковская область"
    },
    {
        "name": "Купянск",
        "region" : "Харьковская область"
    },
    {
        "name": "Лозовая",
        "region" : "Харьковская область"
    },
    {
        "name": "Люботин",
        "region" : "Харьковская область"
    },
    {
        "name": "Мерефа",
        "region" : "Харьковская область"
    },
    {
        "name": "Первомайский",
        "region" : "Харьковская область"
    },
    {
        "name": "Харьков",
        "region" : "Харьковская область"
    },
    {
        "name": "Чугуев",
        "region" : "Харьковская область"
    },
    {
        "name": "Берислав",
        "region" : "Херсонская область"
    },
    {
        "name": "Геническ",
        "region" : "Херсонская область"
    },
    {
        "name": "Голая Пристань",
        "region" : "Херсонская область"
    },
    {
        "name": "Каховка",
        "region" : "Херсонская область"
    },
    {
        "name": "Новая Каховка",
        "region" : "Херсонская область"
    },
    {
        "name": "Скадовск",
        "region" : "Херсонская область"
    },
    {
        "name": "Таврийск",
        "region" : "Херсонская область"
    },
    {
        "name": "Херсон",
        "region" : "Херсонская область"
    },
    {
        "name": "Цюрупинск",
        "region" : "Херсонская область"
    },
    {
        "name": "Волочиск",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Городок",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Деражня",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Дунаевцы",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Изяслав",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Каменец-Подольский",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Красилов",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Нетешин",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Полонное",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Славута",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Староконстантинов",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Хмельницкий",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Шепетовка",
        "region" : "Хмельницкая область"
    },
    {
        "name": "Ватутино",
        "region" : "Черкасская область"
    },
    {
        "name": "Городище",
        "region" : "Черкасская область"
    },
    {
        "name": "Жашков",
        "region" : "Черкасская область"
    },
    {
        "name": "Звенигородка",
        "region" : "Черкасская область"
    },
    {
        "name": "Золотоноша",
        "region" : "Черкасская область"
    },
    {
        "name": "Каменка",
        "region" : "Черкасская область"
    },
    {
        "name": "Канев",
        "region" : "Черкасская область"
    },
    {
        "name": "Корсунь-Шевченковский",
        "region" : "Черкасская область"
    },
    {
        "name": "Монастырище",
        "region" : "Черкасская область"
    },
    {
        "name": "Смела",
        "region" : "Черкасская область"
    },
    {
        "name": "Тальное",
        "region" : "Черкасская область"
    },
    {
        "name": "Умань",
        "region" : "Черкасская область"
    },
    {
        "name": "Христиновка",
        "region" : "Черкасская область"
    },
    {
        "name": "Черкассы",
        "region" : "Черкасская область"
    },
    {
        "name": "Чигирин",
        "region" : "Черкасская область"
    },
    {
        "name": "Шпола",
        "region" : "Черкасская область"
    },
    {
        "name": "Бахмач",
        "region" : "Черниговская область"
    },
    {
        "name": "Бобровица",
        "region" : "Черниговская область"
    },
    {
        "name": "Борзна",
        "region" : "Черниговская область"
    },
    {
        "name": "Городня",
        "region" : "Черниговская область"
    },
    {
        "name": "Десна",
        "region" : "Черниговская область"
    },
    {
        "name": "Ичня",
        "region" : "Черниговская область"
    },
    {
        "name": "Корюковка",
        "region" : "Черниговская область"
    },
    {
        "name": "Мена",
        "region" : "Черниговская область"
    },
    {
        "name": "Нежин",
        "region" : "Черниговская область"
    },
    {
        "name": "Новгород-Северский",
        "region" : "Черниговская область"
    },
    {
        "name": "Носовка",
        "region" : "Черниговская область"
    },
    {
        "name": "Прилуки",
        "region" : "Черниговская область"
    },
    {
        "name": "Седнев",
        "region" : "Черниговская область"
    },
    {
        "name": "Семёновка",
        "region" : "Черниговская область"
    },
    {
        "name": "Чернигов",
        "region" : "Черниговская область"
    },
    {
        "name": "Щорс",
        "region" : "Черниговская область"
    },
    {
        "name": "Вашковцы",
        "region" : "Черновицкая область"
    },
    {
        "name": "Вижница",
        "region" : "Черновицкая область"
    },
    {
        "name": "Герца",
        "region" : "Черновицкая область"
    },
    {
        "name": "Заставна",
        "region" : "Черновицкая область"
    },
    {
        "name": "Кицмань",
        "region" : "Черновицкая область"
    },
    {
        "name": "Новоднестровск",
        "region" : "Черновицкая область"
    },
    {
        "name": "Новоселица",
        "region" : "Черновицкая область"
    },
    {
        "name": "Сокиряны",
        "region" : "Черновицкая область"
    },
    {
        "name": "Сторожинец",
        "region" : "Черновицкая область"
    },
    {
        "name": "Хотин",
        "region" : "Черновицкая область"
    },
    {
        "name": "Черновцы",
        "region" : "Черновицкая область"
    }
]
